--[[********************************************************************
	Copyright (c) 2013-2015 Mogara

  This file is part of QSanguosha-Hegemony.

  This game is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License as
  published by the Free Software Foundation; either version 3.0
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  General Public License for more details.

  See the LICENSE file for more details.

  Mogara
*********************************************************************]]

-- translation for JiangeDefense Package

return {
	["maria_battle"] = "玛利亚夺还战",
	["maria-battle"] = "玛利亚夺还战",
	
	["WOF"] = "自由之翼",
	["Titan"] = "巨人",
	
	["Erwin"] = "艾尔文",
	["Eren"] = "艾伦",
	["Levi"] = "利维尔",
	["Mikasa"] = "三笠",
	["Armin"] = "阿尔敏",
	["Hange"] = "韩吉",
	["WOF_Soldier"] = "士兵",
	
	["Pure_Titan"] = "无垢巨人",
	["Armored_Titan"] = "铠甲巨人",
	["Colossal_Titan"] = "超大型巨人",
	["Beast_Titan"] = "兽之巨人",
	["Cart_Titan"] = "车力巨人",

	["luawugou"] = "无垢",
	[":luawugou"] = "锁定技，你的锦囊牌，装备牌视为【杀】。",

	["titantunshi"] = "吞噬",
	[":titantunshi"] = "锁定技，你杀死一名角色后，体力回复至上限。",

	["titanbody"] = "巨体",
	[":titanbody"] = "锁定技，你无法使用装备，你使用杀无视防具，你攻击距离为3。结束阶段结束时，你回复一点体力。",
	
	["powertitan"] = "智慧",
	[":powertitan"] = "摸牌阶段，你额定摸牌数+2，当你的人物牌叠置时，可以弃置两张牌并平置人物牌。",

	["yinhua"] = "硬化",
	[":yinhua"] = "锁定技，游戏开始时，你获得10个“铠”标记，你受到X点普通伤害时，移除X个“铠”标记，防止之（不足则全弃，令伤害减少等量值）；出牌阶段限一次，你可以弃置任意张装备牌，获得等量“铠”标记。",
    ["kai"] = "铠",
	["#kai"] = "铠",

	["zhuangji"] = "撞击",
	[":zhuangji"] = "锁定技，你的【杀】造成伤害时，若你的“铠”标记不小于5，此伤害+1。",

	["qunxi"] = "群袭",
	[":qunxi"] = "出牌阶段限一次，如果场上有无垢巨人，你可以弃置一张锦囊牌，令人类阵营角色依次打出一张杀，否则其受到一点无来源伤害。",

	["colossaltitan"] = "超巨",
	[":colossaltitan"] = "锁定技，你无法使用装备牌，你的杀无视防具，造成的伤害+1。",

	["huanman"] = "缓慢",
	[":huanman"] = "锁定技，出牌阶段，你使用本阶段第二张或以上的牌时，弃置一张牌。",

	["chebao"] = "核爆",
	[":chebao"] = "锁定技，你出场时，人类阵营角色依次受到1点火焰伤害并弃置2张牌。",
	
	["chere"] = "核热",
	[":chere"] = "锁定技，你防止你受到的火焰伤害。",

	["zhengqi"] = "蒸汽",
	[":zhengqi"] = "每回合限一次，出牌阶段或你成为杀的目标时，你可以失去1点体力和1点体力上限，对你距离为1的人类角色依次造成1点火焰伤害，并弃置其装备区所有牌。",

	["houjiao"] = "吼叫",
	[":houjiao"] = "锁定技，你出场时，已经阵亡的巨人全部以无垢巨人复活并摸5张牌，存活的无垢巨人体力回复至上限，摸5张牌，存活的智慧巨人副将变为“无垢巨人”，且若其不为你，摸5张牌。",

	["wangxue"] = "王血",
	[":wangxue"] = "当你受到伤害时，你可以弃置一张牌令一名无垢巨人承担之；每回合限一次，一张♥/♠牌进入弃牌堆时，你可以获得之，然后若其点数大于10。你回复一点体力。",

	["toushi"] = "投石",
	[":toushi"] = "准备阶段开始时，你可以弃置2张非锦囊牌，令人类阵营角色依次打出一张闪，否则其受到你的2点伤害，并弃置2张牌。",
	
	["erwinchongfeng"] = "冲锋",
	[":erwinchongfeng"] = "锁定技，准备阶段开始时，若场上有【兽之巨人】，你和小兵各执行效果：失去一点体力，弃置【兽之巨人】三张牌。然后视为你和【士兵】各使用一张目标为场上所有除【兽之巨人】外的智慧巨人的【杀】。",
	["xianchu"] = "献出",
	[":xianchu"] = "",
	
	["hatefight"] = "怒战",
	[":hatefight"] = "当你于回合外受到伤害后，你可以失去一点体力或弃置一张红桃牌，执行一个额外回合。锁定技，你的红色牌对敌方角色造成的伤害+1。",
	["tongchou"] = "同仇",
	[":tongchou"] = "结束阶段开始时，你可以令一名友方角色摸X张牌或令一名以上至多X名友方角色依次摸1张牌（X为你失去体力值）。",
	["@tongchou-card"] = "选择对应角色 来源：同仇",
	["lijin"] = "砺进",
	[":lijin"] = "锁定技，准备阶段开始时，你弃置判定区所有牌，重置人物牌。你到“铠之巨人”，“超大型巨人”距离视为1。",
	["jurenhua"] = "巨人化",
	[":jurenhua"] = "",
	
	["suzhan"] = "速斩",
	[":suzhan"] = "出牌阶段你使用杀无次数限制，当你的杀被闪抵消时，你可以摸一张牌。",
    ["pojing"] = "破颈",
	[":pojing"] = "当你的杀对敌方目标造成伤害时，你可以令其失去一点体力上限，然后弃置其手牌数一半的手牌（向上取整）。",	
	["xunji"] = "迅疾",
	[":xunji"] = "出牌阶段限一次，若你装备“立体机动气体”，你可以弃置一张手牌，移动到一名敌方角色右侧。",
	
	["dongcha"] = "洞察",
	[":dongcha"] =  "出牌阶段限一次，你可以弃置一张基本牌/非基本牌，然后依次获得每名敌方角色中的一张同名称/同类别的手牌(观看所有可选牌并选择一张)，并可以以任意方式分配给其他角色。",
    --["tanji"] = "谈计",
	--[":tanji"] = "出牌阶段限一次，你可以交给一名智慧巨人一张牌，让其选择：1，交给你2张与此牌同花色的牌。2，弃置两张牌并叠置。",
    ["siyou"] = "死诱",
	[":siyou"] = "限定技，出牌阶段开始时，你可与一名敌方角色计算距离相互为1，然后你每受到其一点伤害时，可以令一名其他角色摸三张牌。",

	["juesi"] = "决死",
	[":juesi"] = "出牌阶段限一次，你可以失去一点体力，选择一名体力值大于等于你的角色（若你此时进入濒死，你摸X张牌），你移动到该角色上家，视为对其依次使用X张杀（X为你与目标体力值之差且最多为5）。",

	["jiepou"] = "解剖",
	[":jiepou"] = "出牌阶段限一次，你可以展示一名无垢巨人的所有手牌，里面每有一张红桃牌，你摸1张牌。",
    ["beixie"] = "备械",
	[":beixie"] = "出牌阶段每名友方角色限一次，你可以选择出牌堆+弃牌堆中一张其可装备的对应装备栏为空的装备牌，令其使用之。锁定技，友方角色手牌上限+2，你装备标记相关的装备牌额外获得一枚对应标记。",
	
	["white15"] = "无",
	["white10"] = "无",
	["white5"] = "无",
	["white4"] = "无",

	["RittaikidouGas"] = "立体机动气体",
	[":RittaikidouGas"] = "装备牌·坐骑\n\n技能：锁定技，敌方角色与你计算距离+1，你与敌方角色计算距离-1。装备时获得3个“瓦斯”标记，准备阶段开始时弃置一个“瓦斯”标记，标记清空时弃置此装备。",

	["RittaikidouBlade"] = "立体机动刀片",
	[":RittaikidouBlade"] = "装备牌·武器\n\n攻击范围：2\n技能：锁定技，你的杀造成的伤害时，弃置一个“刀片”标记，令伤害+1。装备时获得3个“刀片”标记，标记清空时弃置此装备。",

	["Raisou"] = "雷枪",
    [":Raisou"] = "装备牌·武器\n\n攻击范围：1\n技能：锁定技，你的杀造成的伤害视为雷属性，你的杀造成伤害时，对目标角色和其距离为1的其他角色依次造成一点火焰伤害。",
}